test/fixtures/cassettes/charge_donation.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer sk_test_xgwHvfr4GBgJ9wrUDHoa1E57",
        "Content-Type": "application/x-www-form-urlencoded",
        "Stripe-Version": "2017-06-05"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges?amount=1000&currency=HKD&customer=cus_DaUL9L27e843XN&description=Donation+to+Save+the+children+via+Bravera.co&destination%5Baccount%5D=acct_1D8pvmJTOgSA3tLo&destination%5Bamount%5D=880&receipt_email=simon.garciar%40gmail.com"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"ch_1D9L1lEXtHU8QBy8sVLJxp7P\",\n  \"object\": \"charge\",\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"application\": null,\n  \"application_fee\": null,\n  \"balance_transaction\": \"txn_1D9L1mEXtHU8QBy8QjvDYbaz\",\n  \"captured\": true,\n  \"created\": 1536707533,\n  \"currency\": \"hkd\",\n  \"customer\": \"cus_DaUL9L27e843XN\",\n  \"description\": \"Donation to Save the children via Bravera.co\",\n  \"destination\": \"acct_1D8pvmJTOgSA3tLo\",\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {\n  },\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"on_behalf_of\": \"acct_1D8pvmJTOgSA3tLo\",\n  \"order\": null,\n  \"outcome\": {\n    \"network_status\": \"approved_by_network\",\n    \"reason\": null,\n    \"risk_level\": \"normal\",\n    \"risk_score\": 44,\n    \"seller_message\": \"Payment complete.\",\n    \"type\": \"authorized\"\n  },\n  \"paid\": true,\n  \"receipt_email\": \"simon.garciar@gmail.com\",\n  \"receipt_number\": null,\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_1D9L1lEXtHU8QBy8sVLJxp7P/refunds\"\n  },\n  \"review\": null,\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"src_1D9JN4EXtHU8QBy8JErKq6fH\",\n    \"object\": \"source\",\n    \"amount\": null,\n    \"card\": {\n      \"exp_month\": 3,\n      \"exp_year\": 2025,\n      \"address_zip_check\": \"pass\",\n      \"brand\": \"Visa\",\n      \"card_automatically_updated\": false,\n      \"country\": \"US\",\n      \"cvc_check\": \"pass\",\n      \"fingerprint\": \"FRWKuQtLcmN1ei2N\",\n      \"funding\": \"credit\",\n      \"last4\": \"4242\",\n      \"three_d_secure\": \"optional\",\n      \"name\": null,\n      \"address_line1_check\": null,\n      \"tokenization_method\": null,\n      \"dynamic_last4\": null\n    },\n    \"client_secret\": \"src_client_secret_DaULqlS8hj9GPnrHJy9RIUzp\",\n    \"created\": 1536707535,\n    \"currency\": null,\n    \"customer\": \"cus_DaUL9L27e843XN\",\n    \"flow\": \"none\",\n    \"livemode\": false,\n    \"metadata\": {\n    },\n    \"owner\": {\n      \"address\": {\n        \"city\": null,\n        \"country\": null,\n        \"line1\": null,\n        \"line2\": null,\n        \"postal_code\": \"08002\",\n        \"state\": null\n      },\n      \"email\": \"simon.garciar@gmail.com\",\n      \"name\": \" \",\n      \"phone\": null,\n      \"verified_address\": null,\n      \"verified_email\": null,\n      \"verified_name\": null,\n      \"verified_phone\": null\n    },\n    \"statement_descriptor\": null,\n    \"status\": \"chargeable\",\n    \"type\": \"card\",\n    \"usage\": \"reusable\"\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\",\n  \"transfer\": \"tr_1D9L1mEXtHU8QBy8SH0v58K5\",\n  \"transfer_group\": \"group_ch_1D9L1lEXtHU8QBy8sVLJxp7P\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Tue, 11 Sep 2018 23:12:15 GMT",
        "Content-Type": "application/json",
        "Content-Length": "2640",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Expose-Headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_MnZIFMWV9ynL1R",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"template_id\":\"f9448c06-ff05-4901-bb47-f21a7848c1e7\",\"subject\":null,\"send_at\":null,\"reply_to\":null,\"personalizations\":[{\"to\":[{\"email\":\"simon.garciar@gmail.com\"}],\"substitutions\":{\"-paymentId-\":\"ch_1D9L1lEXtHU8QBy8sVLJxp7P\",\"-donorName-\":\"John Doe\",\"-donationName-\":\"Donation to Save the children via Bravera.co\",\"-donationDate-\":\"2018-09-11 23:12:13\",\"-chargedAmount-\":\"10.0 HKD\",\"-cardType-\":\"Visa\",\"-cardNumber-\":\"Card ending in 4242\"}}],\"mail_settings\":{\"sandbox_mode\":{\"enable\":true}},\"headers\":{},\"from\":{\"name\":\"Bravera\",\"email\":\"admin@bravera.co\"},\"content\":null,\"attachments\":null}",
      "headers": {
        "Authorization": "Bearer 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",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sendgrid.com/v3/mail/send"
    },
    "response": {
      "binary": false,
      "body": "",
      "headers": {
        "Server": "nginx",
        "Date": "Tue, 11 Sep 2018 23:12:15 GMT",
        "Content-Type": "text/plain; charset=utf-8",
        "Content-Length": "0",
        "Connection": "keep-alive",
        "X-Message-Id": "MrO8xf-bTWu4-nUBoH062w",
        "Access-Control-Allow-Origin": "https://sendgrid.api-docs.io",
        "Access-Control-Allow-Methods": "POST",
        "Access-Control-Allow-Headers": "Authorization, Content-Type, On-behalf-of, x-sg-elas-acl",
        "Access-Control-Max-Age": "600",
        "X-No-CORS-Reason": "https://sendgrid.com/docs/Classroom/Basics/API/cors.html"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]